Catalogs/АР_Счетчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_Счетчики</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МаркаСчетчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_ВидыСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаЭкслуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияЭксплуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_ВидРесурса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентТрансформации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/АР_ВидыСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>АР_ВидыСчетчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индивидуальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/АР_Счетчики/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура НаименованиеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	// Формирование списка выбора.
	Список = Новый СписокЗначений();
	Если ЗначениеЗаполнено(Объект.МаркаСчетчика) Тогда
		Список.Добавить(Объект.МаркаСчетчика);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.НомерСчетчика) Тогда
		Список.Добавить(Объект.НомерСчетчика);
		Если ЗначениеЗаполнено(Объект.МаркаСчетчика) Тогда
			Список.Добавить(Объект.МаркаСчетчика + "/" + Объект.НомерСчетчика);
		КонецЕсли;
	КонецЕсли;
	
	// Выбор из списка и обработка выбора.
	РезультатВыбора = ВыбратьИзСписка(Список, Элементы.Наименование);
	
	Если РезультатВыбора <> Неопределено Тогда
		Объект.Наименование = РезультатВыбора.Значение;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВидСчетчикаПриИзменении(Элемент)
	//Если ОбщийСчетчик(Объект.ВидСчетчика) Тогда //Объект.ВидСчетчика = Перечисления.АР_ВидыСчетчиков.Общий Тогда
	//	Элементы.Помещение.Заголовок = "Здание"
	//Иначе	
	//	Элементы.Помещение.Заголовок = "Помещение"
	//КонецЕсли;	
КонецПроцедуры

Функция ОбщийСчетчик(ВидСчетчика)
	Если ВидСчетчика = Перечисления.АР_ВидыСчетчиков.Общий Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции		

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если ОбщийСчетчик(Объект.ВидСчетчика) Тогда //Объект.ВидСчетчика = Перечисления.АР_ВидыСчетчиков.Общий Тогда
	//	Элементы.Помещение.Заголовок = "Здание"
	//Иначе	
	//	Элементы.Помещение.Заголовок = "Помещение"
	//КонецЕсли;	
КонецПроцедуры
